{"projects":[
	{
		"id":20,
		"title":"Technical Debt in FinTech",
		"description":"Talk about how we at OMNIMax overcame (most) of our technical debt.",
		"caption":"While migrating our apps and architecture from a legacy monolith to modern technical stack.",
		"image":"/images/techdebt.png",
		"link":"https://www.youtube.com/watch?v=mKaTk70sRcI",
		"extra":false
	},
	{
		"id":19,
		"name":"devops",
		"title":"DevOps Engineer",
		"description":"Microsoft Certified: DevOps Engineer Expert.",
		"caption":"Issued in 2020, certification demonstrates the ability to combine people, process, and technologies to continuously deliver.",
		"image":"/images/devops.png",
		"link":"https://learn.microsoft.com/api/credentials/share/en-us/JasonButler-4002/D91BE1E80680702F?sharingId=93FA614A6DCFC26D",
		"extra":false
	},
	{
		"id":18,
		"name":"myweekendsleft",
		"title":"My Weekends Left API",
		"description":"Live life expectancy API with public Azure DevOps CI/CD project.",
		"caption":"Developed in 2020 using .NET Core 3.1, Terraforms, Azure Pipelines, xUnit, Moq, Fluent Validation and API versioning.",
		"image":"/images/myweekendsleft.png",
		"link":"https://github.com/jjbutler74/MyWeekendsLeft",
		"extra":false
	},
	{
		"id":17,
		"name":"azuredev",
		"title":"Azure Developer",
		"description":"Microsoft Certified: Azure Developer Associate.",
		"caption":"Issued in 2019, certification validates the skills and knowledge to design and build cloud solutions.",
		"image":"/images/azuredev.png",
		"link":"https://learn.microsoft.com/api/credentials/share/en-us/JasonButler-4002/9DAD8E760CAE5756?sharingId=93FA614A6DCFC26D",
		"extra":false
	},
	{
		"id":1,
		"name":"locationservice",
		"title":"Location Services API",
		"description":"Address lookup, address validation, map generation, territory lookup and more.",
		"caption":"Developed in 2013-2016 using Google's Geocoding API, ASP.NET, C#, Web API, REST, NHibernate and custom caching",
		"image":"/images/locationservice.png",
		"link":"/project.html?name=locationservice",
		"extra":false,
		"screens":[
			{
				"image":"/images/locationservice1.jpg",
				"description":"A suite of easy to implement location services primarily based on Google’s Map APIs.</br></br>Services include single line address search, location validation, map generation, distance to coast measurements, ISO territory lookup, wind coverage zone lookup and building characteristic details.</br></br>The main engine of the Location Service works around many of Google’s limitations, including number of request, incomplete data and misidentified match status.</br></br>This project has required successful on going communications and negotiations with Google to work out technical details and cost."
			}
		]
	},
	{
		"id":2,
		"title":"Magic Math",
		"description":"Multiplication table quiz with responsive design, using 100% HTML5 Local Storage.",
		"caption":"Developed in 2014 using JavaScript, AJAX, jQuery, CSS, Bootstrap and HTML.",
		"image":"/images/magicmath.png",
		"link":"https://jasonbutler.com/magicmath",
		"extra":false
	},
	{
		"id":3,
		"name":"pdfworksheet",
		"title":"PDF Worksheet API",
		"description":"Web service that instantly creates a dynamic PDF based on customer data.",
		"caption":"Developed in 2014 using iTextSharp, ASP.NET, C# and Web API",
		"image":"/images/worksheetpdf.png",
		"link":"/project.html?name=pdfworksheet",
		"extra":false,
		"screens":[
			{
				"image":"/images/ws1.png",
				"description":"A pure code based PDF document generation service. By not relying on template documents a PDF can be generated instantly. Document changes and maintenance are easily handled by modifying the well-defined coding modules.</br></br>Customer data is pulled from a database and processed through a rules engine to define the exact display properties designated by the business needs." 
			},
						{
				"image":"/images/ws2.png",
				"description":"The service includes a comprehensive library to handle most formatting and design requirements; including displaying images (static and dynamic), several table layouts, borders, spacing, etc.</br></br>The insurance related documents generated by this service were developed with extensive business insight; including research into existing insurance forms, cross industry documents and print design standards to create professional looking documents with just the right look and feel."
			}
		]
	},
	{
		"id":4,
		"name":"formscatalog",
		"title":"Forms Catalog",
		"description":"Real-time form filtering on several dimensions. Includes web based copy to clipboard.",
		"caption":"Developed in 2012 using C#, MVC, JavaScript, AJAX, jQuery, CSS and HTML.",
		"image":"/images/formscatalog.png",
		"link":"/project.html?name=formscatalog",
		"extra":false,
		"screens":[
			{
				"image":"/images/formscatalog1.png",
				"description":"Single-Page Application that allows internal and external customers to determine their required forms quickly and easily. The forms list can be filtered by line of business, effective date, states and form type. Each row can be sorted and searched by all fields.</br></br>Selected forms can be copied to the client’s local clipboard simply by clicking a button."
			},
			{
				"image":"/images/formscatalog2.png",
				"description":"By using CSS media queries a print friendly page can be printed directly from the browser's print functionality (a separate print ready page is simply not needed). User preferences are stored in HTML5 local storage."
			}
		]
	},
	{
		"id":5,
		"name":"dtc",
		"title":"Distance to Coast Tool",
		"description":"Users can receive precise address to coast measurements for windstorm insurance.",
		"caption":"Developed in 2012 using Geography Spatial Polygons, C#, MVC, JavaScript, AJAX, jQuery, CSS and HTML.",
		"image":"/images/dtc.png",
		"link":"/project.html?name=dtc",
		"extra":false,
		"screens":[
			{
				"image":"/images/dtc1.png",
				"description":"A precise latitude and longitude is determined with Location Services powered by Google’s geocoding API. Next, calculations are made using the coordinates and three separate company defined coast lines (stored as geography spatial data), which results in an exact measurement to defined borders. Unique polygon processing helps determine what side of the coast line a set of coordinates are located.</br></br>The ease of use and speed of this application has changed the way wind coverage insurance is determined and issued for the better."
			}
		]
	},	
	{
		"id":6,
		"name":"openapp",
		"title":"OpenApp",
		"description":"Client application that facilitates the execution of local programs via web links.",
		"caption":"Developed in 2011 using a custom URI scheme, Windows registry coding and C#",
		"image":"/images/openapp.png",
		"link":"/project.html?name=openapp",
		"extra":false,
		"screens":[
			{
				"image":"/images/openapp1.png",
				"description":"Turns out the challenge of being able to open desktop apps via web links has a simple and elegant solution.</br></br>By making some straight forward Windows registry changes a new URI scheme could be registered that executes a program on the local system, OpenApp.exe."
			},
						{
				"image":"/images/openapp2.png",
				"description":"The program itself is fairly simple, just mapping and executing local programs with meaningful parameters, while also taking into account all security concerns."
			},
						{
				"image":"/images/openapp3.png",
				"description":"The actual program mapping is just an XML value pair list."
			},
						{
				"image":"/images/openapp4.png",
				"description":"Once the application is locally installed, basic HTML tags can activate the local programs."
			}
		]
	},
	{
		"id":7,
		"title":"Glad2Cook.com",
		"description":"Glad2Cook.com is a free online grocery list that makes food shopping fast, easy and enjoyable.",
		"caption":"Developed in 2010 using ASP.NET, C#, AJAX, jQuery, CSS and HTML.",
		"image":"/images/glad2cook.png",
		"link":"http://glad2cook.com/",
		"extra":false
	},
	{
		"id":8,
		"title":"Report Catalog",
		"name":"reportcatalog",
		"description":"Web application for documenting, tracking and distributing thousands of reports.",
		"caption":"Developed for AIG Insurance in 2009 using ASP.NET, VB.NET, jQuery, CSS and HTML.",
		"image":"/images/reportcatalog.png",
		"link":"/project.html?name=reportcatalog",
		"extra":false,
		"screens":[
			{
				"image":"/images/rc1.jpg",
				"description":"The main screen of the Report Catalog displays custom filters and data, based on the users role and settings. From this screen both business users and report developers can track which reports are complete and which reports are due next. The latest report can be accessed directly by clicking on the Last Ran date, allowing business users to do most of their interaction with the system from this one screen."
			},
			{
				"image":"/images/rc2.jpg",
				"description":"The Report Detail page contains a complete archive of past reports, the initial report request, all report changes, report notes (with auto logging) and detailed run instructions so any report developer can easily recreate any report."
			},
			{
				"image":"/images/rc3.jpg",
				"description":"On this screen, report developers can either upload a file or link to any URL, making almost any type of report available through the system. The Next Due Date is calculated based on the report frequency and number of business days (automatically factoring in weekends and holidays)."
			}
		],
		"final":"The Report Catalog, along with the Report Request System and QMF2Excel has completely changed the way reporting is handed at the Recovery division of AIG Insurance, eliminating many past issues with report creation and distribution – all for a fraction of other quoted partial solutions."
	},
	{
		"id":9,
		"name":"chartisintranet",
		"title":" Chartis (AIG) Intranet",
		"description":"Intranet site with user specific applications and reference/training documentation.",
		"caption":"Developed for the Recovery division of AIG Insurance in 2009 using ASP.NET, VB.NET, jQuery, CSS and HTML.",
		"image":"/images/chartisintranet.png",
		"link":"/project.html?name=chartisintranet",
		"extra":false,
		"screens":[
			{
				"image":"/images/grs1.jpg",
				"description":"Intranet home page for Chartis, the Recovery division of AIG Insurance. Developed using master pages and CSS to provide a consistent layout and a complete framework.</br></br>The entire site was built from the ground up on an existing file server. Tech specs: Windows Server 2003, IIS 6 and SQL Server 2005."
			},
			{
				"image":"/images/grs2.jpg",
				"description":"On the Applications page users are logged in automatically based on their LAN Id, with only the applications available to them displayed."
			},
			{
				"image":"/images/grs3.jpg",
				"description":"All reference and training documentation for Chartis are available world wide on the documentation page."
			},
			{
				"image":"/images/grs4.jpg",
				"description":"Documentation administrators can add, edit or update any document. This method of document management and reference has made it much easier and efficient for everyone involved."
			},
			{
				"image":"/images/grs5.jpg",
				"description":"Control of the entire web site is available to administrators from this page, so the site and all applications can be maintained without any backend work (database or code changes)."
			}
		]
	},
	{
		"id":10,
		"name":"reportrequest",
		"title":"Report Request System",
		"description":"Web application for creating, tracking and processing detailed report request.",
		"caption":"Developed AIG Insurance in 2008 using ASP.NET, VB.NET, jQuery, CSS and HTML.",
		"image":"/images/reportrequest.png",
		"link":"/project.html?name=reportrequest",
		"extra":true,
		"screens":[
			{
				"image":"/images/rrs1.jpg",
				"description":"This is the main page of the Report Request System, users have a custom view of this screen only showing request that they have potential actions on."
			},
			{
				"image":"/images/rrs2.jpg",
				"description":"The Create a New Report Request screen has comprehensive validation to ensure all request are submitted with sufficient and accurate information. Report requests on existing reports automatically populate most fields, so users can quickly submit report changes."
			},
			{
				"image":"/images/rrs3.jpg",
				"description":"On the Request Detail page, status changes and notes can be updated based on the request status and the users’ role. By utilizing CSS capabilities, a print friendly page can be generated directly from this page (no need for a print friendly link)."
			}
		],
		"final":"One of the most appreciated features of the system is the automated email system. Based on the users’ role (Requestor, Approver, Developer, etc) and the status of the request, custom emails are sent out instructing the appropriate users of the next steps required (along with direct web links) to complete the tasks."
		
	},
	{
		"id":11,
		"title":"QMF2Excel",
		"description":"Downloads, converts and formats IBM DB2 mainframe data from QMF to MS Excel files.",
		"caption":"Developed in 2008 using VB.NET.",
		"image":"/images/qmf2excel.png",
		"link":"https://jasonbutler.com/qmf2excel/",
		"extra":true
	},
	{
		"id":12,
		"title":"Beans Games",
		"description":"Freeware games intended to help teach letters and spelling in a fun way.",
		"caption":"Developed mostly in 2008 using VB.NET.",
		"image":"/images/beanswordgame.png",
		"link":"http://beansgames.com/",
		"extra":true
	},
	{
		"id":13,
		"title":"Glad2Cook.com Creation Blog",
		"description":"Blogging platform, this implementation was for the creation of Glad2Cook.com.",
		"caption":"Developed in 2006-2007 using ASP.NET, VB.NET, RSS, CSS and HTML.",
		"image":"/images/g2cblog.png",
		"link":"https://jasonbutler.com/g2cblog/",
		"extra":true
	},
	{
		"id":14,
		"title":"Cobb Citizens for Tax Relief",
		"description":"Political website for Cobb County (GA) ballot initiative.",
		"caption":"Developed in 2003 using Classic ASP.NET and HTML.",
		"image":"/images/cobbtax.png",
		"link":"https://jasonbutler.com/portfolio/cobbcitizens/",
		"extra":true
	},
	{
		"id":15,
		"title":"Dale Ritchey website",
		"description":"A campaign website for Georgia State House candidate Dale Ritchey.",
		"caption":"Developed in 2000 using Classic ASP.NET and HTML. Included secure credit card processing, steaming video, volunteer sign-up and back office tools.",
		"image":"/images/daleritchey.png",
		"link":"https://jasonbutler.com/portfolio/daleritchey/",
		"extra":true
	},
	{
		"id":16,
		"title":"Science Fair (Grade 8)",
		"description":"Presentation on Computers, plus games Galactic Horse Racing and Quest for the Rublen.",
		"caption":"Developed in 1980s on the Texas Instruments TI-99/4A with TI Extended BASIC.",
		"image":"/images/ti994a.png",
		"link":"https://youtu.be/hagQJirh9MA",
		"extra":true
	}
]}
	
